package seminar.seminar_1;

import java.util.Scanner;

//Task_1.Улитка ползёт по вертикальному шесту высотой h метров, поднимаясь за день на a метров,
//        а за ночь спускаясь на b метров. На какой день улитка доползёт до вершины шеста?
//        Программа получает на вход натуральные числа h, a, b. Гарантируется, что a>b.
//        Программа должна вывести одно натуральное число.
//Task_2  Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек,
//        если разрешается сделать один разлом по прямой между дольками
//        (то есть разломить шоколадку на два прямоугольника)
public class task_1 {
    public static void main(String[] args) {

        
}
    static void ex0(){
        Scanner sc = new Scanner(System.in);
        System.out.println("Введите высоту шеста: ");
        String world = sc.nextLine();
        System.out.println("Введите верх: ");
        String world_1 = sc.nextLine();
        System.out.println("Введите верх: ");
        String world_2 = sc.nextLine();
    }
}
